In [1]:
import pandas as pd
df=pd.read_csv('sample_dirty_data.csv')

In [2]:
df.head()

      Name   Age         City Gender    JoinDate
0   Alice   25.0     New York      F  2022-01-01
1      bob   NaN  los angeles      M  2022/02/15
2  Charlie  35.0          NaN      M  15-03-2022
3      BOB  30.0  Los Angeles      M  2022-04-10
4      Eve  29.0      Chicago      F         NaN

In [3]:
df.tail()

      Name   Age         City Gender    JoinDate
2  Charlie  35.0          NaN      M  15-03-2022
3      BOB  30.0  Los Angeles      M  2022-04-10
4      Eve  29.0      Chicago      F         NaN
5      NaN  40.0      Chicago    NaN  2022-05-01
6   Alice   25.0     New York      F  2022-01-01

In [4]:
df.shape

(7, 5)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      object
 1   Age       6 non-null      float64
 2   City      6 non-null      object
 3   Gender    6 non-null      object
 4   JoinDate  6 non-null      object
dtypes: float64(1), object(4)
memory usage: 412.0+ bytes

In [6]:
df.columns

Index(['Name', 'Age', 'City', 'Gender', 'JoinDate'], dtype='object')

In [7]:
df.dtypes

Name         object
Age         float64
City         object
Gender       object
JoinDate     object
dtype: object

In [8]:
df.index

RangeIndex(start=0, stop=7, step=1)

In [9]:
df['Name']

0     Alice
1        bob
2    Charlie
3        BOB
4        Eve
5        NaN
6     Alice
Name: Name, dtype: object

In [10]:
df[['Name','Age']]

      Name   Age
0   Alice   25.0
1      bob   NaN
2  Charlie  35.0
3      BOB  30.0
4      Eve  29.0
5      NaN  40.0
6   Alice   25.0

In [11]:
df[df['Age']>30]

      Name   Age     City Gender    JoinDate
2  Charlie  35.0      NaN      M  15-03-2022
5      NaN  40.0  Chicago    NaN  2022-05-01

In [12]:
df.iloc[3]

Name                BOB
Age                30.0
City        Los Angeles
Gender                M
JoinDate     2022-04-10
Name: 3, dtype: object

In [13]:
df.loc[3]

Name                BOB
Age                30.0
City        Los Angeles
Gender                M
JoinDate     2022-04-10
Name: 3, dtype: object

In [14]:
df.isnull().sum()

Name        1
Age         1
City        1
Gender      1
JoinDate    1
dtype: int64

In [15]:
df[df.isnull().any(axis=1)]

      Name   Age         City Gender    JoinDate
1      bob   NaN  los angeles      M  2022/02/15
2  Charlie  35.0          NaN      M  15-03-2022
4      Eve  29.0      Chicago      F         NaN
5      NaN  40.0      Chicago    NaN  2022-05-01

In [16]:
df.dropna(inplace=True)
df

      Name   Age         City Gender    JoinDate
0   Alice   25.0     New York      F  2022-01-01
3      BOB  30.0  Los Angeles      M  2022-04-10
6   Alice   25.0     New York      F  2022-01-01

In [17]:
df.dropna(subset=['Age'],inplace=True)
df

      Name   Age         City Gender    JoinDate
0   Alice   25.0     New York      F  2022-01-01
3      BOB  30.0  Los Angeles      M  2022-04-10
6   Alice   25.0     New York      F  2022-01-01

In [18]:
df.fillna(0,inplace=True)
df

      Name   Age         City Gender    JoinDate
0   Alice   25.0     New York      F  2022-01-01
3      BOB  30.0  Los Angeles      M  2022-04-10
6   Alice   25.0     New York      F  2022-01-01

In [19]:
df=pd.read_csv('sample_dirty_data.csv')

In [20]:
df.fillna(0,inplace=True)
df

      Name   Age         City Gender    JoinDate
0   Alice   25.0     New York      F  2022-01-01
1      bob   0.0  los angeles      M  2022/02/15
2  Charlie  35.0            0      M  15-03-2022
3      BOB  30.0  Los Angeles      M  2022-04-10
4      Eve  29.0      Chicago      F           0
5        0  40.0      Chicago      0  2022-05-01
6   Alice   25.0     New York      F  2022-01-01

In [21]:
df.fillna(2,inplace=True)
df

      Name   Age         City Gender    JoinDate
0   Alice   25.0     New York      F  2022-01-01
1      bob   0.0  los angeles      M  2022/02/15
2  Charlie  35.0            0      M  15-03-2022
3      BOB  30.0  Los Angeles      M  2022-04-10
4      Eve  29.0      Chicago      F           0
5        0  40.0      Chicago      0  2022-05-01
6   Alice   25.0     New York      F  2022-01-01

In [22]:
df=pd.read_csv('sample_dirty_data.csv')

In [23]:
df.fillna(2,inplace=True)
df

      Name   Age         City Gender    JoinDate
0   Alice   25.0     New York      F  2022-01-01
1      bob   2.0  los angeles      M  2022/02/15
2  Charlie  35.0            2      M  15-03-2022
3      BOB  30.0  Los Angeles      M  2022-04-10
4      Eve  29.0      Chicago      F           2
5        2  40.0      Chicago      2  2022-05-01
6   Alice   25.0     New York      F  2022-01-01

In [24]:
df['Age'].fillna(df['Age'].mean(),inplace=True)
df

C:\Users\godly\AppData\Local\Temp\ipykernel_7464\2368695939.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].mean(),inplace=True)

      Name   Age         City Gender    JoinDate
0   Alice   25.0     New York      F  2022-01-01
1      bob   2.0  los angeles      M  2022/02/15
2  Charlie  35.0            2      M  15-03-2022
3      BOB  30.0  Los Angeles      M  2022-04-10
4      Eve  29.0      Chicago      F           2
5        2  40.0      Chicago      2  2022-05-01
6   Alice   25.0     New York      F  2022-01-01

In [25]:
df=pd.read_csv('sample_dirty_data.csv')

In [26]:
df['Age'].fillna(df['Age'].mean(),inplace=True)
df

C:\Users\godly\AppData\Local\Temp\ipykernel_7464\2368695939.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].mean(),inplace=True)

      Name        Age         City Gender    JoinDate
0   Alice   25.000000     New York      F  2022-01-01
1      bob  30.666667  los angeles      M  2022/02/15
2  Charlie  35.000000          NaN      M  15-03-2022
3      BOB  30.000000  Los Angeles      M  2022-04-10
4      Eve  29.000000      Chicago      F         NaN
5      NaN  40.000000      Chicago    NaN  2022-05-01
6   Alice   25.000000     New York      F  2022-01-01

In [27]:
df['City'].fillna(method='ffill',inplace=True)

C:\Users\godly\AppData\Local\Temp\ipykernel_7464\743217686.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['City'].fillna(method='ffill',inplace=True)
C:\Users\godly\AppData\Local\Temp\ipykernel_7464\743217686.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df['City'].fillna(method='ffill',inplace=True)

In [28]:
import warnings
warnings.simplefilter(action='ignore', category=FutureWarning)

In [29]:
df['City'].fillna(method='ffill', inplace=True)

In [30]:
import pandas as pd
df=pd.read_csv('sample_dirty_data.csv')

In [31]:
df['City'].fillna(method='ffill', inplace=True)
df

      Name   Age         City Gender    JoinDate
0   Alice   25.0     New York      F  2022-01-01
1      bob   NaN  los angeles      M  2022/02/15
2  Charlie  35.0  los angeles      M  15-03-2022
3      BOB  30.0  Los Angeles      M  2022-04-10
4      Eve  29.0      Chicago      F         NaN
5      NaN  40.0      Chicago    NaN  2022-05-01
6   Alice   25.0     New York      F  2022-01-01

In [32]:
df.drop_duplicates(inplace=True)
df

      Name   Age         City Gender    JoinDate
0   Alice   25.0     New York      F  2022-01-01
1      bob   NaN  los angeles      M  2022/02/15
2  Charlie  35.0  los angeles      M  15-03-2022
3      BOB  30.0  Los Angeles      M  2022-04-10
4      Eve  29.0      Chicago      F         NaN
5      NaN  40.0      Chicago    NaN  2022-05-01
6   Alice   25.0     New York      F  2022-01-01

In [33]:
df.drop_duplicates(inplace=True)
df

      Name   Age         City Gender    JoinDate
0   Alice   25.0     New York      F  2022-01-01
1      bob   NaN  los angeles      M  2022/02/15
2  Charlie  35.0  los angeles      M  15-03-2022
3      BOB  30.0  Los Angeles      M  2022-04-10
4      Eve  29.0      Chicago      F         NaN
5      NaN  40.0      Chicago    NaN  2022-05-01
6   Alice   25.0     New York      F  2022-01-01

In [34]:
df=pd.read_csv('sample_dirty_data.csv')

In [35]:
df.drop_duplicates(inplace=True)
df

      Name   Age         City Gender    JoinDate
0   Alice   25.0     New York      F  2022-01-01
1      bob   NaN  los angeles      M  2022/02/15
2  Charlie  35.0          NaN      M  15-03-2022
3      BOB  30.0  Los Angeles      M  2022-04-10
4      Eve  29.0      Chicago      F         NaN
5      NaN  40.0      Chicago    NaN  2022-05-01
6   Alice   25.0     New York      F  2022-01-01

In [36]:
print(df.duplicated())

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [37]:
df.drop_duplicates(inplace=True)
df

      Name   Age         City Gender    JoinDate
0   Alice   25.0     New York      F  2022-01-01
1      bob   NaN  los angeles      M  2022/02/15
2  Charlie  35.0          NaN      M  15-03-2022
3      BOB  30.0  Los Angeles      M  2022-04-10
4      Eve  29.0      Chicago      F         NaN
5      NaN  40.0      Chicago    NaN  2022-05-01
6   Alice   25.0     New York      F  2022-01-01

In [38]:
df['Name'] = df['Name'].str.lower().str.strip()

In [39]:
df.drop_duplicates(inplace=True)
df

      Name   Age         City Gender    JoinDate
0    alice  25.0     New York      F  2022-01-01
1      bob   NaN  los angeles      M  2022/02/15
2  charlie  35.0          NaN      M  15-03-2022
3      bob  30.0  Los Angeles      M  2022-04-10
4      eve  29.0      Chicago      F         NaN
5      NaN  40.0      Chicago    NaN  2022-05-01

In [40]:
df['JoinDate']=pd.to_datetime(df['JoinDate'])

ValueError: time data "2022/02/15" doesn't match format "%Y-%m-%d", at position 1. You might want to try:
    - passing `format` if your strings have a consistent format;
    - passing `format='ISO8601'` if your strings are all ISO8601 but not necessarily in exactly the same format;
    - passing `format='mixed'`, and the format will be inferred for each element individually. You might want to use `dayfirst` alongside this.

In [ ]:
df['JoinDate'] = pd.to_datetime(df['JoinDate'], errors='coerce', dayfirst=True)

In [ ]:
df['JoinDate']=pd.to_datetime(df['JoinDate'])
df

In [ ]:
df['JoinDate']=pd.to_datetime(df['JoinDate'])
df

In [ ]:
df=pd.read_csv('sample_dirty_data.csv')

In [ ]:
df['JoinDate']=pd_to_datetime(df['JoinDate'])
df

In [ ]:
import pandas as pd
df['JoinDate'] = df['JoinDate'].str.replace('/', '-')

In [ ]:
df['JoinDate'] = df['JoinDate'].str.replace('/', '-')

In [ ]:
df['JoinDate']=pd.to_datetime(df['JoinDate'])
df

In [ ]:
df=pd.read_csv('sample_dirty_data.csv')

In [ ]:
df['JoinDate'] = df['JoinDate'].str.replace('/', '-')
df['JoinDate']=pd.to_datetime(df['JoinDate'])
df

In [ ]:

errors='coerce'

In [ ]:
df['JoinDate']=pd.to_datetime(df['JoinDate'])
df

In [ ]:
df['Name']=df['Name'].str.strip()
df

In [ ]:
df.rename(columns={'Age':'bnew'},inplace=True)
df

In [ ]:
df['Gender'].replace({'M': 'Male'}, inplace=True)
df

In [ ]:
df.drop('Name', axis=1, inplace=True)
df

In [41]:
df.isnull().sum()

Name        1
Age         1
City        1
Gender      1
JoinDate    1
dtype: int64

In [44]:
df.dropna(inplace=True)

In [45]:
df.isnull().sum()

Name        0
Age         0
City        0
Gender      0
JoinDate    0
dtype: int64

In [46]:
df.duplicated()

0    False
3    False
dtype: bool

In [47]:
df['JoinDate'] = pd.to_datetime(df['JoinDate'])

In [48]:
df

    Name   Age         City Gender   JoinDate
0  alice  25.0     New York      F 2022-01-01
3    bob  30.0  Los Angeles      M 2022-04-10

In [49]:
df['JoinDate'] = pd.to_datetime(df['JoinDate'])

In [50]:
df

    Name   Age         City Gender   JoinDate
0  alice  25.0     New York      F 2022-01-01
3    bob  30.0  Los Angeles      M 2022-04-10